<script setup>
import { onMounted, reactive, ref } from 'vue';
import TheStardust from './Stardust/TheStardust.vue';
import IconArrowDown from './icons/IconArrowDown.vue';
import {animate, inView, stagger} from 'motion';

const FAQArray = reactive([
    {
        id: 0,
        question: 'Что такое блокчейн и как он работает?',
        answer: '<p>Блокчейн (Blockchain) - это децентрализованная база данных, которая использует криптографию для защиты и управления цифровыми записями. Блокчейн используется для создания безопасных, прозрачных и неизменяемых записей, которые могут быть проверены и подтверждены любым участником сети. Блокчейн работает путем создания цепочки блоков (blockchain), где каждый блок содержит информацию о транзакции, которая была проведена в сети. Каждый блок содержит хеш (hash) предыдущего блока, который связывает блоки вместе в цепочку. Это создает децентрализованную сеть, которая может быть использована для обмена информацией между участниками без централизованного контроля. Когда транзакция происходит в блокчейн-сети, она проверяется участниками, называемыми майнерами (miners), которые используют свою вычислительную мощность для проверки и подтверждения транзакции. Одобренная транзакция записывается в новый блок, который затем добавляется в цепочку блоков. Каждый участник в сети имеет копию блокчейн, что гарантирует, что информация в сети всегда доступна и актуальна. Блокчейн используется для создания криптовалют, таких как биткоин, но также может быть использован для обеспечения безопасности и прозрачности в различных других областях, таких как финансы, право, здравоохранение и т.д. благодаря своей уникальной архитектуре.</p><p class="mt-4">Представь, что у нас есть большой книжный шкаф, где мы храним книги с историями о том, что мы делаем каждый день. Мы хотим, чтобы все, кто хочет, могли прочитать эти книги и узнать, что мы делали. Теперь представь, что мы добавляем новую книгу в этот шкаф каждый раз, когда мы что-то делаем. Но вот проблема - некоторые люди могут попытаться изменить то, что мы написали в наших книгах, чтобы скрыть что-то, что они сделали. Как нам защитить наши книги от таких людей? Так вот, блокчейн - это как будто мы даем каждой книге секретный замок, который нельзя сломать. Каждый раз, когда мы добавляем новую книгу в шкаф, мы закрываем ее на замок. Это означает, что если кто-то пытается изменить книгу, они не смогут открыть замок и изменить записи внутри. Но есть еще одна важная вещь - чтобы убедиться, что каждый в нашей группе знает, что происходит в шкафу, мы даем каждому человеку в нашей группе копию всех книг в шкафу. Это означает, что если кто-то попытается изменить книгу, мы можем сравнить ее копии с оригиналом и узнать, что было изменено. Вот как блокчейн работает! Мы используем его, чтобы защитить наши записи от изменений и чтобы все в нашей группе знали, что происходит.</p>',
        isOpen: false,
    },
    {
        id: 1,
        question: 'Какие преимущества блокчейна перед централизованными системами?',
        answer: `<p>Блокчейн имеет несколько преимуществ перед централизованными системами, такими как:</p>
<ol class="list-decimal list-outside pl-6">
    <li>Децентрализация: блокчейн является децентрализованной системой, где информация распределена между участниками сети. Это означает, что нет единой точки отказа, которая может быть скомпрометирована или атакована, что обеспечивает большую безопасность.</li>
    <li>Прозрачность: каждый участник блокчейн-сети имеет копию базы данных и может проверить любую транзакцию в сети. Это обеспечивает высокую прозрачность и уменьшает возможность мошенничества.</li>
    <li>Надежность: блокчейн использует криптографию для защиты информации, что делает систему очень надежной. Это означает, что данные не могут быть подделаны или изменены без ключа доступа, который известен только авторизованным участникам.</li>
    <li>Эффективность: блокчейн может обрабатывать транзакции быстро и эффективно, что делает его привлекательным для использования в различных областях, таких как финансы, логистика и др.</li>
    <li>Низкие затраты: блокчейн может помочь снизить затраты на транзакции и устранить посредников, такие как банки или правительственные учреждения, что может сэкономить деньги и время.</li>
</ol>
<p>В целом, блокчейн представляет собой надежную, прозрачную и эффективную технологию, которая может помочь улучшить процессы в различных областях и обеспечить большую безопасность и прозрачность.</p><p>Конечно! Представь, что у нас есть большой дружный клуб, где мы все собрались, чтобы играть вместе. Мы любим играть в игры, но мы хотим, чтобы все были уверены, что игры проходят честно и никто не пытается обмануть.</p>
<p>Так вот, блокчейн - это как будто мы даем каждому члену клуба свой блокнот, в который они записывают все игры, которые они играют. Каждый раз, когда мы играем в игру, мы записываем ее в свой блокнот, и мы не можем изменить то, что мы записали, потому что это наша личная запись.</p>
<p>
    Но есть еще одна важная вещь - чтобы убедиться, что все игроки в клубе знают, что происходит, мы даем каждому члену клуба копию всех блокнотов. Это означает, что если кто-то попытается изменить свой блокнот, мы можем сравнить его с копиями и узнать, что было изменено.
    Таким образом, блокчейн помогает нам играть в игры честно и без мошенничества, и все в клубе знают, что происходит. Как тебе такое объяснение?
</p>`,
        isOpen: false,
    },
    {
        id: 2,
        question: 'Что такое смарт-контракт и как он работает?',
        answer: `<div>
                        <p>
                            Смарт-контракт - это программа, которая написана на языке программирования и запущена на
                            блокчейне. Он представляет собой цифровой контракт, который автоматически выполняется при
                            выполнении определенных условий, записанных в контракте.
                        </p>
                        <p>
                            Смарт-контракты работают следующим образом: сначала они создаются и записываются на
                            блокчейн. Затем они ждут выполнения определенного условия, которое также описано в
                            контракте. Когда условие выполняется, смарт-контракт автоматически запускает выполнение
                            предусмотренных действий.
                        </p>
                        <p>
                            Например, допустим, что два человека хотят заключить контракт на покупку недвижимости. Они
                            могут написать смарт-контракт, который будет содержать условия покупки, такие как сумма
                            денег и дата покупки. Когда все условия будут выполнены, смарт-контракт автоматически
                            переведет деньги продавцу, а покупатель получит право собственности на недвижимость.
                        </p>
                        <p>
                            Одним из главных преимуществ смарт-контрактов является то, что они автоматически выполняются
                            без участия третьей стороны, такой как юрист или банк. Это позволяет сократить время и
                            затраты на заключение контрактов, а также снизить возможность мошенничества.
                        </p>
                        <p>
                            Смарт-контракты могут быть использованы в различных областях, таких как финансы, логистика,
                            имущественные отношения и многие другие, где требуется автоматизированный и безопасный
                            способ заключения контрактов.
                        </p>
                    </div>
                    <div>
                        <p>
                            Конечно! Смарт-контракт - это как если бы ты написал записку своему другу, чтобы он выполнил
                            какое-то задание, например, купил мороженое на стойке у продавца, когда цена на мороженое
                            достигнет определенной суммы. Ты можешь написать эту записку на бумаге, но вместо этого мы
                            можем написать ее на компьютере и отправить на специальную цифровую площадку, которая
                            называется блокчейн.
                        </p>
                        <p>
                            Там она будет храниться и ждать, пока цена на мороженое достигнет нужной суммы. Когда это
                            произойдет, смарт-контракт автоматически отправит деньги на счет продавца, и твой друг
                            получит свое мороженое.
                        </p>
                        <p>
                            Смарт-контракты могут использоваться в разных ситуациях, где люди должны что-то сделать друг
                            для друга, а им нужен надежный способ, чтобы быть уверенными, что все происходит честно и
                            правильно. Такие контракты помогают избежать ошибок и мошенничества, потому что они
                            автоматически выполняются только при выполнении определенных условий.
                        </p>
                    </div>`,
        isOpen: false,
    },
    {
        id: 3,
        question: 'Какие особенности языка Solidity, используемого для написания смарт-контрактов?',
        answer: `<div>
                        <p>
                            Solidity - это язык программирования, который используется для написания смарт-контрактов на
                            платформе Ethereum. Некоторые из особенностей языка Solidity включают:
                        </p>
                        <ol class="list-outside list-decimal pl-6">
                            <li>
                                Типизированные переменные: Solidity поддерживает типизацию переменных, что означает, что
                                вы можете указать, какой тип данных должен содержаться в каждой переменной. Это помогает
                                предотвратить ошибки при написании смарт-контрактов.
                            </li>
                            <li>
                                Наследование: Solidity поддерживает наследование, что означает, что вы можете создавать
                                классы смарт-контрактов, которые наследуют свойства других классов. Это упрощает
                                повторное использование кода и уменьшает количество дублирования кода.
                            </li>
                            <li>
                                Управление памятью: Solidity позволяет разработчикам управлять памятью, что означает,
                                что вы можете определять, как память используется во время выполнения смарт-контракта.
                                Это помогает уменьшить затраты на газ (единицы измерения стоимости выполнения операций в
                                Ethereum) при выполнении контракта.
                            </li>
                            <li>
                                Встроенные функции: Solidity имеет множество встроенных функций, таких как функции для
                                работы с датами и временем, функции для работы с адресами и функции для работы с
                                криптографическими хешами.
                            </li>
                            <li>
                                Проверка условий: Solidity позволяет разработчикам проверять условия, прежде чем
                                выполнять какие-либо действия в смарт-контракте. Это помогает убедиться, что выполнение
                                контракта происходит только при выполнении необходимых условий, что может быть очень
                                важно для обеспечения безопасности и правильности работы контракта.
                            </li>
                        </ol>
                        <p>
                            В целом, Solidity является мощным и гибким языком программирования, который позволяет
                            разработчикам создавать надежные и безопасные смарт-контракты на платформе Ethereum.
                        </p>
                    </div>
                    <div>
                        <p>
                            Solidity - это как язык, на котором можно говорить с компьютером и давать ему инструкции,
                            чтобы он мог выполнять определенные задачи. Этот язык особенно хорошо подходит для создания
                            смарт-контрактов на платформе Ethereum.
                        </p>
                        <p>
                            В Solidity есть много специальных инструментов и возможностей, которые помогают создавать
                            безопасные и надежные смарт-контракты. Например, вы можете сказать компьютеру, какие данные
                            должны быть сохранены в контракте, и какие условия должны быть выполнены, чтобы эти данные
                            могли быть изменены.
                        </p>
                        <p>
                            Также, как в жизни, когда мы должны следовать определенным правилам, чтобы все было честно и
                            правильно, смарт-контракты на Solidity могут помочь людям следовать определенным правилам,
                            когда они работают с Ethereum. Иногда это может быть важно, чтобы защитить людей и
                            обеспечить безопасность.
                        </p>
                    </div>`,
        isOpen: false,
    },
    {
        id: 4,
        question: 'Какие существуют популярные блокчейн-платформы?',
        answer: `<p>
                        Существует множество блокчейн-платформ, которые поддерживают смарт-контракты, каждая из них
                        имеет свои особенности, преимущества и недостатки. Некоторые из популярных блокчейн-платформ для
                        смарт-контрактов включают:
                    </p>
                    <ol class="list-outside list-decimal pl-6">
                    <li>
                        Ethereum: это самая популярная блокчейн-платформа для смарт-контрактов. Ethereum имеет свой язык
                        программирования Solidity, который используется для написания смарт-контрактов. Ethereum также
                        поддерживает создание децентрализованных приложений на основе блокчейна.
                    </li>
                    <li>
                        Binance Smart Chain: это блокчейн-платформа, созданная Binance, одной из крупнейших
                        криптовалютных бирж. Binance Smart Chain поддерживает смарт-контракты на языке Solidity, а также
                        позволяет использовать множество инструментов разработки и интеграции.
                    </li>
                    <li>
                        Polkadot: это блокчейн-платформа, созданная для создания интероперабельных блокчейнов. Polkadot
                        использует язык Solidity для создания смарт-контрактов, но также поддерживает другие языки
                        программирования.
                    </li>
                    <li>
                        Tron: это блокчейн-платформа, созданная для разработки децентрализованных приложений и развития
                        контента на блокчейне. Tron поддерживает языки программирования Solidity и Java для создания
                        смарт-контрактов.
                    </li>
                    <li>
                        Cardano: это блокчейн-платформа, созданная для обеспечения безопасности и масштабируемости в
                        децентрализованных приложениях и системах. Cardano использует свой собственный язык
                        программирования - Haskell - для написания смарт-контрактов.
                    </li>
                    </ol>
                    <p>
                        Это только некоторые из популярных блокчейн-платформ для смарт-контрактов. В зависимости от нужд
                        проекта, выбирают ту платформу, которая лучше всего подходит для его целей.
                    </p>`,
        isOpen: false,
    },
    {
        id: 5,
        question: 'Какие решения на основе блокчейна существуют в настоящее время?',
        answer: `<p>
                        В настоящее время существует множество решений на основе блокчейна, которые применяются в
                        различных отраслях и областях. Некоторые из наиболее распространенных решений на основе
                        блокчейна включают в себя:
                    </p>
                    <ol class="list-outside list-decimal pl-6">
                        <li>
                            Криптовалюты: наиболее известное применение блокчейна - это создание криптовалют, таких как
                            Bitcoin, Ethereum и многих других.
                        </li>
                        <li>
                            Смарт-контракты: благодаря блокчейн-технологии можно создавать и выполнять автоматические
                            контракты между участниками сети.
                        </li>
                        <li>
                            Децентрализованные финансы (DeFi): это новый класс приложений, которые используют блокчейн
                            для создания децентрализованных финансовых сервисов, таких как обмены, кредитование и
                            страхование.
                        </li>
                        <li>
                            Управление и аудит цепочки поставок: блокчейн может помочь обеспечить прозрачность и
                            безопасность в управлении цепочками поставок, что позволяет участникам отслеживать каждый
                            этап процесса.
                        </li>
                        <li>
                            Хранение медицинских данных: блокчейн может использоваться для создания безопасных,
                            прозрачных и защищенных хранилищ медицинских данных, которые могут быть легко доступным для
                            врачей и пациентов.
                        </li>
                        <li>
                            Голосование: блокчейн может обеспечить прозрачность и безопасность при проведении
                            голосований, позволяя избежать мошенничества и фальсификаций результатов голосования.
                        </li>
                        <li>
                            Игровая индустрия: блокчейн может использоваться для создания децентрализованных игровых
                            приложений и платформ, обеспечивая безопасность и защиту интересов пользователей.
                        </li>
                    </ol>
                    <p>
                        Это только некоторые из многих решений на основе блокчейна, которые существуют в настоящее
                        время. Блокчейн-технология имеет огромный потенциал для решения ряда проблем в различных сферах
                        деятельности, и ее применение только будет расширяться в будущем.
                    </p>`,
        isOpen: false,
    },
    {
        id: 6,
        question: 'Как решения на основе блокчейна можно применять в бизнесе?',
        answer: `<p>
                        Для бизнеса предоставляет множество возможностей для повышения эффективности, улучшения
                        безопасности и уменьшения издержек. Ниже приведены некоторые примеры применения блокчейна в
                        бизнесе:
                    </p>
                    <ol class="list-outside list-decimal pl-6">
                        <li>
                            Управление цепочкой поставок: блокчейн позволяет сделать цепочку поставок более прозрачной,
                            эффективной и безопасной. Каждый этап процесса может быть отслежен, что позволяет улучшить
                            управление запасами, сократить издержки и снизить риск мошенничества.
                        </li>
                        <li>
                            Финансовые транзакции: блокчейн может использоваться для облегчения финансовых транзакций,
                            ускорения процесса и уменьшения издержек. Это может быть особенно полезно для международных
                            переводов и платежей.
                        </li>
                        <li>
                            Аудит и отчетность: блокчейн может использоваться для создания более прозрачных и точных
                            систем аудита и отчетности. Это позволяет упростить процесс проверки финансовых отчетов и
                            сократить время, затрачиваемое на их подготовку.
                        </li>
                        <li>
                            Идентификация и безопасность: блокчейн может использоваться для создания более безопасных и
                            надежных систем идентификации и аутентификации. Это может помочь улучшить безопасность и
                            защитить данные клиентов от взломов.
                        </li>
                        <li>
                            Управление правами на интеллектуальную собственность: блокчейн может использоваться для
                            создания систем управления правами на интеллектуальную собственность, облегчив процесс
                            получения и продажи лицензий на патенты и другие интеллектуальные права.
                        </li>
                    </ol>
                    <p>
                        Это только некоторые из многих способов, которыми блокчейн может быть применен в бизнесе.
                        Блокчейн-технология имеет огромный потенциал для улучшения различных аспектов бизнеса, и ее
                        использование будет только расширяться в будущем.
                    </p>`,
        isOpen: false,
    },
    {
        id: 7,
        question: 'Какие инструменты нужны для разработки приложений на блокчейне и Solidity?',
        answer: `<p>
                        Для разработки приложений на блокчейне и Solidity необходимо использовать ряд инструментов.
                        Некоторые из наиболее важных инструментов перечислены ниже:
                    </p>
                    <ol class="list-outside list-decimal pl-6">
                        <li>
                            Ethereum: это платформа, на которой работают большинство смарт-контрактов, написанных на
                            Solidity. Ethereum предоставляет инфраструктуру для запуска и хранения смарт-контрактов.
                        </li>
                        <li>
                            Solidity: это язык программирования, который используется для написания смарт-контрактов на
                            Ethereum. Он поддерживает все основные структуры данных, операторы и функции, которые нужны
                            для разработки смарт-контрактов.
                        </li>
                        <li>
                            Remix: это онлайн-инструмент, который позволяет разработчикам Solidity создавать,
                            тестировать и отлаживать смарт-контракты без необходимости установки дополнительного
                            программного обеспечения на свой компьютер.
                        </li>
                        <li>
                            Truffle: это фреймворк для разработки смарт-контрактов, который предоставляет набор
                            инструментов для управления сборкой, развертыванием и тестированием смарт-контрактов.
                        </li>
                        <li>
                            Ganache: это инструмент, который позволяет разработчикам создавать локальную сеть Ethereum
                            для разработки и тестирования смарт-контрактов.
                        </li>
                        <li>
                            Metamask: это расширение браузера, которое позволяет пользователям Ethereum
                            взаимодействовать с смарт-контрактами, используя свой обычный веб-браузер.
                        </li>
                        <li>
                            Web3.js: это библиотека JavaScript, которая позволяет веб-разработчикам взаимодействовать с
                            блокчейном Ethereum через API.
                        </li>
                    </ol>
                    <p>
                        Это только некоторые из инструментов, которые нужны для разработки приложений на блокчейне и
                        Solidity. Каждый инструмент выполняет свои задачи и имеет свои преимущества, и в зависимости от
                        потребностей проекта может потребоваться использование других инструментов.
                    </p>`,
        isOpen: false,
    },
    {
        id: 8,
        question: 'Где я смогу работать если освою блокчейн разработку?',
        answer: ` <div>
                        <p>
                            Если вы выучите Solidity, то вы можете стать разработчиком смарт-контрактов на Ethereum, что
                            открывает для вас ряд возможностей для работы в индустрии блокчейна. Некоторые из возможных
                            мест работы могут включать:
                        </p>
                        <ol class="list-outside list-decimal pl-6">
                            <li>
                                Компании, занимающиеся блокчейн-разработкой: сейчас многие компании, особенно стартапы,
                                занимаются разработкой блокчейн-проектов, и многие из них ищут разработчиков
                                смарт-контрактов.
                            </li>
                            <li>
                                Криптовалютные биржи: многие криптовалютные биржи имеют свои собственные
                                смарт-контракты, которые используются для обеспечения безопасности транзакций.
                            </li>
                            <li>
                                Консалтинговые компании: многие консалтинговые компании начинают предоставлять услуги по
                                блокчейн-разработке и ищут разработчиков с опытом работы со смарт-контрактами.
                            </li>
                            <li>
                                Финансовые учреждения: финансовые учреждения могут использовать блокчейн для улучшения
                                своих процессов и создания безопасных средств передачи данных, что может потребовать
                                разработки смарт-контрактов.
                            </li>
                            <li>
                                Стартапы: стартапы, занимающиеся блокчейном, часто ищут разработчиков смарт-контрактов
                                для создания инновационных проектов.
                            </li>
                        </ol>
                        <p>
                            Это только несколько примеров мест работы, где вы можете использовать свои знания Solidity.
                            Сфера блокчейна продолжает развиваться, и существует большой спрос на специалистов, которые
                            могут разрабатывать смарт-контракты на различных блокчейн-платформах.
                        </p>
                    </div>
                    <div>
                        <p>
                            Кроме перечисленных вариантов, разработчики смарт-контрактов на Solidity могут также
                            работать в других компаниях и проектах, которые используют технологии блокчейна. Например:
                        </p>
                        <ol class="list-outside list-decimal pl-6">
                            <li>
                                Крупные компании и корпорации: многие крупные компании и корпорации из разных отраслей
                                начинают исследовать возможности применения блокчейна, и некоторые из них могут искать
                                разработчиков смарт-контрактов для создания своих решений на базе блокчейна.
                            </li>
                            <li>
                                Государственные организации: государственные организации также начинают исследовать
                                возможности блокчейна, и могут искать разработчиков смарт-контрактов для создания систем
                                голосования, реестров и других решений.
                            </li>
                            <li>
                                Фонды и инвесторы: существуют инвестиционные фонды, которые фокусируются на
                                инвестировании в проекты, использующие блокчейн-технологии, и могут искать разработчиков
                                смарт-контрактов для аудита и создания новых проектов.
                            </li>
                            <li>
                                Независимая разработка: разработчики смарт-контрактов могут работать над своими
                                собственными проектами и создавать децентрализованные приложения на блокчейне, которые
                                могут быть использованы в различных отраслях.
                            </li>
                            <li>
                                Криптовалютные проекты: криптовалютные проекты, особенно те, которые используют
                                Ethereum, могут искать разработчиков смарт-контрактов для создания новых токенов,
                                децентрализованных бирж и других решений.
                            </li>
                        </ol>
                        <p>
                            Таким образом, работа разработчиком смарт-контрактов на Solidity может быть очень
                            разнообразной и предоставить множество возможностей для карьерного роста и развития.
                        </p>
                    </div>
                    <div>
                        <p>
                            Дополнительно можно отметить, что Solidity является одним из самых популярных языков
                            программирования для создания смарт-контрактов на блокчейне Ethereum. Именно на этой
                            платформе работает большинство известных децентрализованных приложений, таких как
                            CryptoKitties, Augur, MakerDAO и многие другие.
                        </p>
                        <p>
                            Следовательно, знание Solidity может открыть для разработчика двери в индустрию блокчейна и
                            децентрализованных приложений, которая является одной из наиболее динамично развивающихся в
                            современном мире. Более того, знание Solidity может стать ценным навыком для разработчиков в
                            других областях, таких как финансовые технологии, аналитика данных, информационная
                            безопасность и т.д.
                        </p>
                        <p>
                            Наконец, разработка смарт-контрактов на Solidity может быть интересна и для тех, кто хочет
                            внести свой вклад в создание децентрализованных приложений, которые могут привести к
                            революции в различных областях, начиная от финансов и заканчивая управлением государством.
                        </p>
                    </div>`,
        isOpen: false,
    },
]);

const clickHandle = (e, idx) => {
    e.preventDefault()
    FAQArray[idx].isOpen = !FAQArray[idx].isOpen;
    console.log(e);
    if( FAQArray[idx].isOpen ) {
        setTimeout(() => {
        window.scrollTo({
            top: e.pageY - 50,
            left: 0,
            behavior: 'smooth',
        });
    }, 50);
    }

    
};

const accordionContainer = ref(null)

onMounted(() => {
    inView(
        accordionContainer.value,
        ({ target }) => {
            animate(
                target.children,
                { y: [100, 0], opacity: [0, 1] },
                {
                    delay: stagger(0.2, { start: 0.5 }),
                    duration: 0.5,
                    easing: [0.22, 0.03, 0.26, 1],
                }
            );
        },
        { margin: '100px 0px' }
    );
})
</script>

<template>
    <section class="overflow-hidden">
        <div class="container relative pt-[70px] pb-20 lg:pb-[110px] 2xl:pb-[180px]">
            <TheStardust
                class="-left-[580px] -bottom-[440px] h-[780px] rotate-45"
                blur-filter="170px"
                background-rectangle="linear-gradient(180deg, rgba(24, 75, 255, 0) 0%, #174AFF 100%)"
                background-eclipse="linear-gradient(180deg, rgba(0, 194, 255, 0) 0%, #FF29C3 100%)" />
            <TheStardust
                class="-top-[320px] -right-[370px] h-[620px] -rotate-[135deg]"
                blur-filter="200px"
                background-rectangle="linear-gradient(180deg, rgba(24, 255, 158, 0) 0%, #17FFE3 100%)"
                background-eclipse="linear-gradient(180deg, #2C4982 0%, #2CD095 100%)" />
            <h2 class="mb-7 2xl:mb-[60px]"><span class="text-[#30A2FF]">Отвечаем</span> на вопросы</h2>

            <div ref="accordionContainer">
                <div
                    v-for="(faq, idx) of FAQArray"
                    :key="faq.id"
                    class="border-t-[1px] border-white last-of-type:border-b-[1px] 2xl:border-t-2 last-of-type:2xl:border-b-2">
                    <button
                        @mousedown="(e) => clickHandle(e, idx)" @keydown.space="faq.isOpen = !faq.isOpen"  
                        class="relative block w-full py-3 pr-[25px] text-left text-sm font-medium md:pl-2 md:text-sm lg:text-lg 2xl:py-5 2xl:pl-[50px] 2xl:pr-[50px] 2xl:text-[32px]">
                        {{ faq.question }}
                        <IconArrowDown
                            :active="faq.isOpen"
                            class="absolute top-1/2 right-3 h-[14px] w-[14px] -translate-y-1/2 lg:h-[20px] lg:w-[20px] 2xl:right-10 2xl:h-[40px] 2xl:w-[40px]" />
                    </button>
    
                    <Transition enter-from-class="opacity-0" enter-active-class="transition-opacity duration-700"  >
                        <div
                            class="space-y-4 py-4 px-1 text-xs text-white/80 md:text-sm lg:text-base 2xl:px-6 2xl:text-xl"
                            v-if="faq.isOpen"
                            v-html="faq.answer"></div>
                    </Transition>
                </div>
            </div>
        </div>
    </section>
</template>

<style scoped></style>
