<template>
    <section class="py-36 container relative">
        <h2 class="mb-10">Что о нас <span class="text-[#30A2FF]">студенты думают:</span></h2>
        <div class="flex absolute left-0 gap-10 items-start">
            <div v-for="item in feedbacks" :key="item.id" class="w-[620px] bg-[#141414] flex p-10">
                <img src="/user.png" alt="user" width="56" height="56" class="mr-5 aspect-square self-start">
                <div>
                    <div class="text-[#01A7FF] text-[26px] font-medium mb-5">Nicheriin</div>
                    <p class="text-2xl">{{ item.text }}</p>
                </div>
            </div>
        </div>
    </section>
</template>

<script>
export default {
    components: {
      
  },
  data() {
    return {
        feedbacks: [
            {
                id: 0,
                user: "Nicheriin",
                text: "Я очень доволен этим курсом! Как новичок в области блокчейна, я получил отличное введение в эту технологию и язык программирования Solidity. Я научился создавать и развертывать смарт-контракты на блокчейне Ethereum, используя Solidity.Преподаватели курса были очень квалифицированными и знающими специалистами в этой области. Они представили материал в понятной и доступной форме, объясняя сложные концепции с помощью простых примеров. Кроме того, курс предоставил мне возможность практически применять полученные знания."
            },
            {
                id: 1,
                user: "Nicheriin",
                text: "Отличный курс для начинающих! Я узнал много нового о блокчейне и Solidity. Преподаватели были профессиональными и давали ясные объяснения сложных концепций. Мне очень понравилось, что я мог практически применять полученные знания, создавая смарт-контракты на Ethereum. Я определенно рекомендую этот курс!"
            },
            {
                id: 2,
                user: "Nicheriin",
                text: "Я очень доволен этим курсом! Он был очень полезен для меня, как начинающего в области блокчейна и языка Solidity. Преподаватели были очень квалифицированными и дружелюбными, объясняя все очень ясно и понятно. Мне понравилось, что я мог практиковаться в создании смарт-контрактов на Ethereum, используя инструменты, такие как Remix, Truffle и Ganache. Я рекомендую этот курс всем, кто интересуется блокчейном и Solidity!"
            },
            {
                id: 3,
                user: "Nicheriin",
                text: "Я очень доволен этим курсом! Как новичок в области блокчейна, я получил отличное введение в эту технологию и язык программирования Solidity. Я научился создавать и развертывать смарт-контракты на блокчейне Ethereum, используя Solidity.Преподаватели курса были очень квалифицированными и знающими специалистами в этой области. Они представили материал в понятной и доступной форме, объясняя сложные концепции с помощью простых примеров. Кроме того, курс предоставил мне возможность практически применять полученные знания."
            }
        ]
    }
  },
    setup () {
        

        return {}
    }
}
</script>

<style scoped>

</style>